app/views/customers/dashboard.html.erb

        				<h2><small><i class="fa fa-users"></i>Customer Dashboard:</small></h2>
            			<%= pie_chart Customer.group(:fname).count %>
---
SELECT COUNT(*) AS count_all, updated_at AS updated_at FROM "customers" GROUP BY "customers"."updated_at"

        				<h2><small><i class="fa fa-shopping-cart"></i>Orders Dashboard:</small></h2>
            			<%= pie_chart Order.group(:name).count %>
---
SELECT COUNT(*) AS count_all, name AS name FROM "orders" GROUP BY "orders"."name"

            <h2><small><i class="fa fa-shopping-cart"></i>Country Dashboard:</small></h2>
            <%= geo_chart Customer.group(:country).count %>
---
SELECT COUNT(*) AS count_all, country AS country FROM "customers" GROUP BY "customers"."country"