app/controllers/customers_controller.rb

INSERT INTO "customers" ("fname", "lname", "company", "country", "mobile", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "customers" SET "company" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["company", "India"], ["updated_at", "2015-05-12 05:02:24.323406"], ["id", 8]]
---
  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 4]]
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @customer = Customer.find(params[:id])

SELECT "customers".* FROM "customers"
---
  def export
    @customer = Customer.all

SELECT "customers".* FROM "customers"
---
  def report
    @customers = Customer.all