app/controllers/orders_controller.rb

  def index
    #@orders = Order.all
    #def index
      #session[:cust_id] = params[:format]
      #@orders = Order.where(customer_id: params[:format])
    #end
    @orders =  Customer.joins(:orders).select('customers.fname,orders.id as id, orders.name as name,orders.po_no as po_no,orders.po_date as po_date,orders.due_date as due_date')
---
SELECT customers.fname,orders.id as id, orders.name as name,orders.po_no as po_no,orders.po_date as po_date,orders.due_date as due_date FROM "customers" INNER JOIN "orders" ON "orders"."customer_id" = "customers"."id"

  def cust_order
    session[:customer_id] = params[:format]
    @customer = Customer.find(params[:format])
    @customer.fname
    @orders = @customer.orders
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]

  def show
    @orders = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 0]]

  def create
    #@order = Order.new(order_params)
    #if @order.save
    #  redirect_to orders_path
    #else
    #  render :new
    #end
    @order = Order.new(order_params)
    @order.customer_id = session[:customer_id]
    if @order.save
---
INSERT INTO "orders" ("name", "po_no", "po_date", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "NEXUS 4"], ["po_no", 1023], ["po_date", "2015-05-06"], ["due_date", "2015-05-12"], ["created_at", "2015-05-06 09:45:29.757487"], ["updated_at", "2015-05-06 09:45:29.757487"]]

  def edit
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 10]]

  def update
    @order = Order.find(params[:id])
    if @order.update(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "orders" SET "po_no" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["po_no", 1453], ["updated_at", "2015-05-11 07:11:45.418474"], ["id", 10]]

  def delete
    @order = Order.find(params[:format])
    @order.destroy
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 6]]

  def destroy
    @order = Order.find(params[:id])
    #@order.customer_id = session[:customer_id]
    @order.destroy
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]